## Terraform plan  [job](https://circleci.com/gh/fr123k/kube-hetzner/176) e9d5d4921218a8c2fa55b0e2ecf0e44cb3723c65 :white_check_mark:

Plan Summary:
```bash
Plan: 4 to add, 0 to change, 0 to destroy.
Plan: 4 to add, 0 to change, 0 to destroy.
```

Resource Summary:
```
  # hcloud_firewall.k3s has changed
        # (6 unchanged blocks hidden)
  # hcloud_network.k3s has changed
  # hcloud_server.first_control_plane has been deleted
  # hcloud_ssh_key.default has changed
─────────────────────────────────────────────────────────────────────────────
  # hcloud_server.agents[0] will be created
  # hcloud_server.agents[1] will be created
  # hcloud_server.control_planes[0] will be created
  # hcloud_server.first_control_plane will be created
─────────────────────────────────────────────────────────────────────────────
  # hcloud_firewall.k3s has changed
        # (6 unchanged blocks hidden)
  # hcloud_network.k3s has changed
  # hcloud_server.first_control_plane has been deleted
  # hcloud_ssh_key.default has changed
─────────────────────────────────────────────────────────────────────────────
  # hcloud_server.agents[0] will be created
  # hcloud_server.agents[1] will be created
  # hcloud_server.control_planes[0] will be created
  # hcloud_server.first_control_plane will be created
─────────────────────────────────────────────────────────────────────────────
```

<details>
    <summary>Show Details:</summary>

```bash

Initializing the backend...

Successfully configured the backend "http"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Reusing previous version of hetznercloud/hcloud from the dependency lock file
- Reusing previous version of hashicorp/random from the dependency lock file
- Installing hetznercloud/hcloud v1.33.1...
- Installed hetznercloud/hcloud v1.33.1 (signed by a HashiCorp partner, key ID 5219EACB3A77198B)
- Installing hashicorp/random v3.1.2...
- Installed hashicorp/random v3.1.2 (signed by HashiCorp)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
hcloud_ssh_key.default: Refreshing state... [id=6189215]
hcloud_network.k3s: Refreshing state... [id=1571494]
random_password.k3s_token: Refreshing state... [id=none]
hcloud_network_subnet.k3s: Refreshing state... [id=1571494-10.0.0.0/16]
hcloud_firewall.k3s: Refreshing state... [id=369073]
hcloud_server.first_control_plane: Refreshing state... [id=19794600]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # hcloud_firewall.k3s has changed
  ~ resource "hcloud_firewall" "k3s" {
        id     = "369073"
        name   = "k3s-firewall"
        # (1 unchanged attribute hidden)

      + apply_to {
          + server = 19795461
        }

        # (6 unchanged blocks hidden)
    }

  # hcloud_network.k3s has changed
  ~ resource "hcloud_network" "k3s" {
        id                = "1571494"
      + labels            = {}
        name              = "k3s-net"
        # (2 unchanged attributes hidden)
    }

  # hcloud_server.first_control_plane has been deleted
  - resource "hcloud_server" "first_control_plane" {
      - backups                    = false -> null
      - datacenter                 = "fsn1-dc14" -> null
      - delete_protection          = false -> null
      - firewall_ids               = [
          - 369073,
        ] -> null
      - id                         = "19794600" -> null
      - ignore_remote_firewall_ids = false -> null
      - image                      = "ubuntu-20.04" -> null
      - ipv4_address               = "49.12.246.85" -> null
      - ipv6_address               = "2a01:4f8:c012:4d2f::1" -> null
      - ipv6_network               = "2a01:4f8:c012:4d2f::/64" -> null
      - keep_disk                  = false -> null
      - labels                     = {
          - "engine"      = "k3s"
          - "provisioner" = "terraform"
        } -> null
      - location                   = "fsn1" -> null
      - name                       = "k3s-control-plane-0" -> null
      - rebuild_protection         = false -> null
      - rescue                     = "linux64" -> null
      - server_type                = "cx11" -> null
      - ssh_keys                   = [
          - "6189215",
        ] -> null
      - status                     = "running" -> null

      - network {
          - alias_ips   = [] -> null
          - ip          = "10.0.0.2" -> null
          - mac_address = "86:00:00:0c:a8:21" -> null
          - network_id  = 1571494 -> null
        }
    }

  # hcloud_ssh_key.default has changed
  ~ resource "hcloud_ssh_key" "default" {
        id          = "6189215"
      + labels      = {}
        name        = "K3S terraform module - Provisioning SSH key"
        # (2 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # hcloud_server.agents[0] will be created
  + resource "hcloud_server" "agents" {
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = [
          + 369073,
        ]
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "ubuntu-20.04"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + labels                     = {
          + "engine"      = "k3s"
          + "k3s_upgrade" = "true"
          + "provisioner" = "terraform"
        }
      + location                   = "fsn1"
      + name                       = "k3s-agent-0"
      + rebuild_protection         = false
      + rescue                     = "linux64"
      + server_type                = "cx21"
      + ssh_keys                   = [
          + "6189215",
        ]
      + status                     = (known after apply)

      + network {
          + alias_ips   = []
          + ip          = "10.0.0.4"
          + mac_address = (known after apply)
          + network_id  = 1571494
        }
    }

  # hcloud_server.agents[1] will be created
  + resource "hcloud_server" "agents" {
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = [
          + 369073,
        ]
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "ubuntu-20.04"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + labels                     = {
          + "engine"      = "k3s"
          + "k3s_upgrade" = "true"
          + "provisioner" = "terraform"
        }
      + location                   = "fsn1"
      + name                       = "k3s-agent-1"
      + rebuild_protection         = false
      + rescue                     = "linux64"
      + server_type                = "cx21"
      + ssh_keys                   = [
          + "6189215",
        ]
      + status                     = (known after apply)

      + network {
          + alias_ips   = []
          + ip          = "10.0.0.5"
          + mac_address = (known after apply)
          + network_id  = 1571494
        }
    }

  # hcloud_server.control_planes[0] will be created
  + resource "hcloud_server" "control_planes" {
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = [
          + 369073,
        ]
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "ubuntu-20.04"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + labels                     = {
          + "engine"      = "k3s"
          + "k3s_upgrade" = "true"
          + "provisioner" = "terraform"
        }
      + location                   = "fsn1"
      + name                       = "k3s-control-plane-1"
      + rebuild_protection         = false
      + server_type                = "cx11"
      + ssh_keys                   = [
          + "6189215",
        ]
      + status                     = (known after apply)

      + network {
          + alias_ips   = []
          + ip          = "10.0.0.3"
          + mac_address = (known after apply)
          + network_id  = 1571494
        }
    }

  # hcloud_server.first_control_plane will be created
  + resource "hcloud_server" "first_control_plane" {
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = [
          + 369073,
        ]
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "ubuntu-20.04"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + labels                     = {
          + "engine"      = "k3s"
          + "provisioner" = "terraform"
        }
      + location                   = "fsn1"
      + name                       = "k3s-control-plane-0"
      + rebuild_protection         = false
      + rescue                     = "linux64"
      + server_type                = "cx11"
      + ssh_keys                   = [
          + "6189215",
        ]
      + status                     = (known after apply)

      + network {
          + alias_ips   = []
          + ip          = "10.0.0.2"
          + mac_address = (known after apply)
          + network_id  = 1571494
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + agents_public_ip        = [
      + (known after apply),
      + (known after apply),
    ]
  + controlplanes_public_ip = [
      + (known after apply),
      + (known after apply),
    ]

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hetznercloud/hcloud from the dependency lock file
- Reusing previous version of hashicorp/random from the dependency lock file
- Using previously-installed hetznercloud/hcloud v1.33.1
- Using previously-installed hashicorp/random v3.1.2

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
random_password.k3s_token: Refreshing state... [id=none]
hcloud_network.k3s: Refreshing state... [id=1571494]
hcloud_ssh_key.default: Refreshing state... [id=6189215]
hcloud_network_subnet.k3s: Refreshing state... [id=1571494-10.0.0.0/16]
hcloud_firewall.k3s: Refreshing state... [id=369073]
hcloud_server.first_control_plane: Refreshing state... [id=19794600]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # hcloud_firewall.k3s has changed
  ~ resource "hcloud_firewall" "k3s" {
        id     = "369073"
        name   = "k3s-firewall"
        # (1 unchanged attribute hidden)

      + apply_to {
          + server = 19795461
        }

        # (6 unchanged blocks hidden)
    }

  # hcloud_network.k3s has changed
  ~ resource "hcloud_network" "k3s" {
        id                = "1571494"
      + labels            = {}
        name              = "k3s-net"
        # (2 unchanged attributes hidden)
    }

  # hcloud_server.first_control_plane has been deleted
  - resource "hcloud_server" "first_control_plane" {
      - backups                    = false -> null
      - datacenter                 = "fsn1-dc14" -> null
      - delete_protection          = false -> null
      - firewall_ids               = [
          - 369073,
        ] -> null
      - id                         = "19794600" -> null
      - ignore_remote_firewall_ids = false -> null
      - image                      = "ubuntu-20.04" -> null
      - ipv4_address               = "49.12.246.85" -> null
      - ipv6_address               = "2a01:4f8:c012:4d2f::1" -> null
      - ipv6_network               = "2a01:4f8:c012:4d2f::/64" -> null
      - keep_disk                  = false -> null
      - labels                     = {
          - "engine"      = "k3s"
          - "provisioner" = "terraform"
        } -> null
      - location                   = "fsn1" -> null
      - name                       = "k3s-control-plane-0" -> null
      - rebuild_protection         = false -> null
      - rescue                     = "linux64" -> null
      - server_type                = "cx11" -> null
      - ssh_keys                   = [
          - "6189215",
        ] -> null
      - status                     = "running" -> null

      - network {
          - alias_ips   = [] -> null
          - ip          = "10.0.0.2" -> null
          - mac_address = "86:00:00:0c:a8:21" -> null
          - network_id  = 1571494 -> null
        }
    }

  # hcloud_ssh_key.default has changed
  ~ resource "hcloud_ssh_key" "default" {
        id          = "6189215"
      + labels      = {}
        name        = "K3S terraform module - Provisioning SSH key"
        # (2 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # hcloud_server.agents[0] will be created
  + resource "hcloud_server" "agents" {
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = [
          + 369073,
        ]
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "ubuntu-20.04"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + labels                     = {
          + "engine"      = "k3s"
          + "k3s_upgrade" = "true"
          + "provisioner" = "terraform"
        }
      + location                   = "fsn1"
      + name                       = "k3s-agent-0"
      + rebuild_protection         = false
      + rescue                     = "linux64"
      + server_type                = "cx21"
      + ssh_keys                   = [
          + "6189215",
        ]
      + status                     = (known after apply)

      + network {
          + alias_ips   = []
          + ip          = "10.0.0.4"
          + mac_address = (known after apply)
          + network_id  = 1571494
        }
    }

  # hcloud_server.agents[1] will be created
  + resource "hcloud_server" "agents" {
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = [
          + 369073,
        ]
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "ubuntu-20.04"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + labels                     = {
          + "engine"      = "k3s"
          + "k3s_upgrade" = "true"
          + "provisioner" = "terraform"
        }
      + location                   = "fsn1"
      + name                       = "k3s-agent-1"
      + rebuild_protection         = false
      + rescue                     = "linux64"
      + server_type                = "cx21"
      + ssh_keys                   = [
          + "6189215",
        ]
      + status                     = (known after apply)

      + network {
          + alias_ips   = []
          + ip          = "10.0.0.5"
          + mac_address = (known after apply)
          + network_id  = 1571494
        }
    }

  # hcloud_server.control_planes[0] will be created
  + resource "hcloud_server" "control_planes" {
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = [
          + 369073,
        ]
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "ubuntu-20.04"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + labels                     = {
          + "engine"      = "k3s"
          + "k3s_upgrade" = "true"
          + "provisioner" = "terraform"
        }
      + location                   = "fsn1"
      + name                       = "k3s-control-plane-1"
      + rebuild_protection         = false
      + server_type                = "cx11"
      + ssh_keys                   = [
          + "6189215",
        ]
      + status                     = (known after apply)

      + network {
          + alias_ips   = []
          + ip          = "10.0.0.3"
          + mac_address = (known after apply)
          + network_id  = 1571494
        }
    }

  # hcloud_server.first_control_plane will be created
  + resource "hcloud_server" "first_control_plane" {
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = [
          + 369073,
        ]
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "ubuntu-20.04"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + labels                     = {
          + "engine"      = "k3s"
          + "provisioner" = "terraform"
        }
      + location                   = "fsn1"
      + name                       = "k3s-control-plane-0"
      + rebuild_protection         = false
      + rescue                     = "linux64"
      + server_type                = "cx11"
      + ssh_keys                   = [
          + "6189215",
        ]
      + status                     = (known after apply)

      + network {
          + alias_ips   = []
          + ip          = "10.0.0.2"
          + mac_address = (known after apply)
          + network_id  = 1571494
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + agents_public_ip        = [
      + (known after apply),
      + (known after apply),
    ]
  + controlplanes_public_ip = [
      + (known after apply),
      + (known after apply),
    ]

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>

<!-- github-comment: {"JobID":"bc727c60-6810-42b9-af1c-d8647e20a3c3","JobName":"terraform-plan","SHA1":"e9d5d4921218a8c2fa55b0e2ecf0e44cb3723c65","TemplateKey":"plan","Vars":{}} -->